**Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.**

In [3]:
import pandas as pd
series1= pd.Series([ 4, 8, 15, 16, 23,42])
series1

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

**Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.**

In [14]:
#creating varaible list containing even number from 1 to 10

l1 = [(i+1)**2 for i in range(10) ] 
print(l1)

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

In [22]:
import pandas as pd 
series2 = pd.Series(l1)
series2

0      1
1      4
2      9
3     16
4     25
5     36
6     49
7     64
8     81
9    100
dtype: int64

**Q3.Create a Pandas DataFrame that contains the following data:**

|    Name      |     Age   |  Gender    |
|--------------|-----------|------------|
| Alice        |25         |Female      |
| Bob          |30         |Male        |
| Claire       |27         |Female      |

**Then, print the DataFrame.**

In [19]:
dict1 = {
    "Name":["Alice","Bob","Claire"],
    "Age":[25,30,27],
    "Gender":["Female","Male","Female"]
}

{'Name': ['Alice', 'Bob', 'Claire'], 'Age': [25, 30, 27], 'Gender': ['Female', 'Male', 'Female']}

In [23]:
df=pd.DataFrame(dict1)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

**Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.**

**A DataFrame in pandas is a two-dimensional labeled data structure with columns of potentially different types. It is similar to a spreadsheet or a SQL table, where data is organized in rows and columns. Each column can contain a different type of data, such as numbers, strings, or dates.**

**On the other hand, a pandas Series is a one-dimensional labeled array that can contain data of any type, such as integers, strings, or booleans. It is similar to a column in a DataFrame.**

In [25]:
##Example to show show dataframe which is 2-Dimensional 

#dictionary for dataframe
company_details={
    "Name":["Shreyash","Srish","Sudhanshu","Mohan"],
    "emp_id":[121,131,141,151],
    "email_id":["shrey@gmail.com","krish@gmail.com","sudh@gmail.com","mohan@gmail.com"],
    "designation":["Developer","CEO","Mentor","MLops"]
}

In [29]:
import pandas as pd
df1=pd.DataFrame(company_details)
df1

        Name  emp_id         email_id designation
0   Shreyash     121  shrey@gmail.com   Developer
1      Srish     131  krish@gmail.com         CEO
2  Sudhanshu     141   sudh@gmail.com      Mentor
3      Mohan     151  mohan@gmail.com       MLops

In [30]:
type(df1)

pandas.core.frame.DataFrame

Data type of given dataset is data frame which is 2-dimensional.

In [31]:
#Using the existing data set to show series in pandas 
df2 = df1["designation"]
df2

0    Developer
1          CEO
2       Mentor
3        MLops
Name: designation, dtype: object

In [32]:
type(df2)

pandas.core.series.Series

**Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?**

In [37]:
#Creating dictionary for data set 

company_sales={
    "Name":["Shreyash","Krish","Sudhanshu","Mohan"],
    "emp_id":[121,None,141,151],
    "email_id":["shrey@gmail.com","krish@gmail.com","sudh@gmail.com","mohan@gmail.com"],
    "designation":["Developer","CEO","Mentor","MLops"],
    "sales":[50000,45325,4578,None]
}

In [38]:
df3=pd.DataFrame(company_sales)
df3

        Name  emp_id         email_id designation    sales
0   Shreyash   121.0  shrey@gmail.com   Developer  50000.0
1      Krish     NaN  krish@gmail.com         CEO  45325.0
2  Sudhanshu   141.0   sudh@gmail.com      Mentor   4578.0
3      Mohan   151.0  mohan@gmail.com       MLops      NaN

**Dropping the missing values in DataFrame, it can be done using the dropna() method, it removes all the NaN values in the dataframe.**

In [40]:
df3.dropna()

        Name  emp_id         email_id designation    sales
0   Shreyash   121.0  shrey@gmail.com   Developer  50000.0
2  Sudhanshu   141.0   sudh@gmail.com      Mentor   4578.0

**Q6. Which of the following is mutable in nature Series, DataFrame, Panel?**

**In pandas, Series and DataFrame are mutable in nature.**

**Panel is considered immutable.**

**That means, Series and DataFrame objects can be modified after they are created, and any changes made to them will be reflected in the original objects. On the other hand, Panel objects are generally not modified once created, and any changes made to them usually result in the creation of a new object.**
**Note that while Series and DataFrame objects are mutable, it is generally recommended to avoid modifying them in place, as this can lead to unexpected results and errors. Instead, it is often better to create a new object with the desired modifications.**

**Q7. Create a DataFrame using multiple Series. Explain with an example.**

**By using concat() method you can merge multiple series together into DataFrame. This takes several params, for our scenario we use list that takes series to combine and axis=1 to specify merge series as columns instead of rows. Note that using axis=0 appends series to rows instead of columns.**

In [49]:
import pandas as pd
# Create pandas Series
courses = pd.Series(["Data Science Masters","Java with DSA","Full Stack Web Development"])
fees = pd.Series([7000,7500,8000])
discount  = pd.Series([3500,3000,2500])

# concat() supports to combine multiple series.
df7=pd.concat([courses,fees,discount],axis=1)
df7.columns = ['course','fees','discount']
df7

                       course  fees  discount
0        Data Science Masters  7000      3500
1               Java with DSA  7500      3000
2  Full Stack Web Development  8000      2500